# RemoveSet Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SelectionFilterElement..::..RemoveSet Method
SelectionFilterElement Class See Also
---
Removes a set of ElementIds from the filter's set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int RemoveSet(
	ICollection<ElementId> ids
)
```

Visual Basic
---
```text
Public Function RemoveSet ( _
	ids As ICollection(Of ElementId) _
) As Integer
```

Visual C++
---
```text
public:
int RemoveSet(
	ICollection<ElementId^>^ ids
)
```

# ### Parameters
ids
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> The set of ElementIds to remove.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SelectionFilterElement Class
Autodesk.Revit.DB Namespace